app/controllers/accommodations_controller.rb

    def create
      @accommodation = Accommodation.new(accommodation_params)
      #@accommodation = Accommodation.new
      @accommodation.current_step = params[:accommodation][:current_step]

        if params[:previous_button]
         @accommodation.previous_step
        elsif @accommodation.next_step
          render 'new' #1
        elsif @accommodation.valid? && @accommodation.next_step
          session[:accommodation_step] = @accommodation.current_step
          #render 'new'
        #elsif params[:accommodation][:availability]
          #availability = Date.new(
         #   params[:accommodation]["availability(1i)"].to_i,
           # params[:accommodation]["availability(2i)"].to_i,
           # params[:accommodation]["availability(3i)"].to_i
          #)
           # @accommodation.availability = availability
        #else
        if @accommodation.last_step?
          @accommodation.save
---
INSERT INTO "accommodations" ("title", "description", "accommodation_type", "vacancies", "address", "city", "state", "postal_code", "amenities", "photos", "available_dates", "min_stay", "max_stay", "volunteer_preferences", "work_schedule", "tasks_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

    def index
      @accommodations = Accommodation.all
---
SELECT "accommodations".* FROM "accommodations"

    def show
      @accommodation = Accommodation.find(params[:id])
---
SELECT "accommodations".* FROM "accommodations" WHERE "accommodations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_accommodation
      @accommodation = Accommodation.find(params[:id])
---
SELECT "accommodations".* FROM "accommodations" WHERE "accommodations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]