app/controllers/conversations_controller.rb

  def index
    @conversations = Conversation.where("sender_id = ? OR receiver_id = ?", current_user.id, current_user.id)
---
SELECT "conversations".* FROM "conversations" WHERE (sender_id = 30 OR receiver_id = 30)