app/controllers/users_controller.rb

  def update_user_type
    #Rails.logger.debug "\n\nparams:#{params.inspect}\n\n"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]