app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "user_type", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "Ju2024@gmail.com"], ["password_digest", "[FILTERED]"], ["user_type", nil], ["created_at", "2024-08-23 16:46:53.389966"], ["updated_at", "2024-08-23 16:46:53.389966"], ["role", nil]]

  def set_user_type
    @user = User.find(params[:id])
    @user.update(user_type_params)
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", "1"], ["updated_at", "2024-08-23 16:49:55.756855"], ["id", 16]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", "1"], ["updated_at", "2024-08-27 16:38:34.100297"], ["id", 24]]